results/gcs_nvme/fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k.out
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: (g=0): rw=rw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=10
...
fio-3.28
Starting 10 processes
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)
fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: Laying out IO file (1 file / 4096MiB)
[...]

fio-rw:rw-rwmixread:33-numjobs:10-iodepth:10-bs:4k: (groupid=0, jobs=10): err= 0: pid=2589: Mon Mar  4 18:45:28 2024
  read: IOPS=44.4k, BW=173MiB/s (182MB/s)(55.3GiB/326795msec)
    slat (nsec): min=1390, max=1003.8M, avg=7411.73, stdev=1032553.61
    clat (usec): min=25, max=38521k, avg=620.70, stdev=50171.15
     lat (usec): min=27, max=38521k, avg=628.17, stdev=50181.77
    clat percentiles (usec):
     |  1.00th=[   33],  5.00th=[   36], 10.00th=[   37], 20.00th=[   39],
     | 30.00th=[   41], 40.00th=[   43], 50.00th=[   44], 60.00th=[   45],
     | 70.00th=[   47], 80.00th=[   50], 90.00th=[   59], 95.00th=[   76],
     | 99.00th=[29492], 99.50th=[33817], 99.90th=[45351], 99.95th=[45876],
     | 99.99th=[55837]
   bw (  KiB/s): min= 3266, max=2291440, per=100.00%, avg=230814.52, stdev=22410.48, samples=5019
   iops        : min=  816, max=572860, avg=57703.13, stdev=5602.63, samples=5019
  write: IOPS=90.1k, BW=352MiB/s (369MB/s)(112GiB/326795msec); 0 zone resets
    slat (nsec): min=1837, max=90087k, avg=78589.58, stdev=1621213.90
    clat (usec): min=5, max=38521k, avg=612.90, stdev=49601.31
     lat (usec): min=28, max=38521k, avg=691.56, stdev=49626.99
    clat percentiles (usec):
     |  1.00th=[   33],  5.00th=[   36], 10.00th=[   37], 20.00th=[   39],
     | 30.00th=[   41], 40.00th=[   43], 50.00th=[   44], 60.00th=[   46],
     | 70.00th=[   47], 80.00th=[   50], 90.00th=[   60], 95.00th=[   77],
     | 99.00th=[29492], 99.50th=[33817], 99.90th=[45351], 99.95th=[45876],
     | 99.99th=[54264]
   bw (  KiB/s): min= 6708, max=4652632, per=100.00%, avg=468183.65, stdev=45491.75, samples=5022
   iops        : min= 1677, max=1163158, avg=117045.36, stdev=11372.94, samples=5022
  lat (usec)   : 10=0.01%, 20=0.01%, 50=79.97%, 100=17.44%, 250=1.02%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.07%, 10=0.10%, 20=0.05%, 50=1.29%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%, >=2000=0.01%
  cpu          : usr=2.27%, sys=5.22%, ctx=111441, majf=0, minf=237
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=14503658,29436654,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=10

Run status group 0 (all jobs):
   READ: bw=173MiB/s (182MB/s), 173MiB/s-173MiB/s (182MB/s-182MB/s), io=55.3GiB (59.4GB), run=326795-326795msec
  WRITE: bw=352MiB/s (369MB/s), 352MiB/s-352MiB/s (369MB/s-369MB/s), io=112GiB (121GB), run=326795-326795msec

Disk stats (read/write):
  nvme0n1: ios=87771/111206, merge=0/667, ticks=179902/25600459, in_queue=25783592, util=75.40%